package day04;

public class Ex05 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/* 연산자 
		 단항연산자  a++
		 이항연산자  num1+ num2
		 삼항연산자  (조건)? 참 : 거짓 
		 
		 대입연산자  =  (할당, 치환)
		 a=10     (하나의 변수는 하나의 값만 저장됨)
		 
		 부호연산자  + , -
		 num = -num;
		 
		 산술연산자
		 + - *  /  %(나머지연산자)  
		 
		 증감, 감소 연산자
		 ++ , --
		 
		 관계연산자
		 >, <  ,   >= , <= , == , !=  
		 
		 논리연산자
		 && (이고 논리곱)  ,  || (이거나  논리합 ) , 부정(!)
		 
		 복합대입연산자
		 num+=10;   // num = num+10
		 *= , -=, /= 
		 
		 조건연산자 (삼항연산자)
		 (조건식)?참:거짓		 
		 
		 캐스트연산자 (형변환연산자)
		 (자료형)
		 		 
		*/

	}

}
